# 정렬, Aggregation, Group By
## DataFrame, Series의 정렬 : sort_values()
- sort_values()는 sql의 order by와 유사함
  - 주요 파라미터
    1. by : 특정 컬럼을 입력하면 해당 컬럼으로 정렬 수행
    1. ascending=True 오름차순, ascending=False 내림차순 > default값은 오름차순
    1. inplace

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv(r'C:\Users\Administrator\DS_Python\data\titanic\train.csv')

In [5]:
# Name 오름차순 정렬

sorted = df.sort_values(by=['Name'])
sorted.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.25,NaN,S

In [7]:
# Pclass, Name 내림차순 정렬
# 여러 개의 컬럼으로 정렬하려면 by에 리스트 형식으로 정렬하려는 컬럼을 입력

sorted = df.sort_values(by=['Pclass', 'Name'], ascending=False)
sorted.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5,NaN,S
282,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,0,0,345778,9.5,NaN,S

## Aggregation 함수의 사용
### min(), max(), sum(), count(), mean()
- 바로 호출할 경우 전 컬럼에 적용하므로 특정 컬럼에 적용하기 위해서는 추출 후 적용할 것

In [8]:
df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [10]:
df['Age'].count()

714

In [11]:
df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

## groupby() 적용
### DF의 groupby() 사용 시, 입력 파라미터 by에 컬럼을 입력하면 대상 컬럼으로 groupby 됌
- DataFrame에 groupby()를 호출하면 DataFrameGroupBy라는 또다른 형태의 DF를 반환

In [12]:
groupby = df.groupby(by='Pclass')
print(type(groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

- DF에 groupby()를 호출해 반환된 결과에 aggregation 함수를 호출하면 groupby() 대상 컬럼을 제외한 모든 컬럼에 aggregation 함수를 적용함

In [14]:
groupby = df.groupby('Pclass').count()
groupby

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491